tutorials/cfdemSolverMultiphase/small_scale_hearth_drainage/run/CFD/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{

    walls
    {
        type        fixedFluxPressure;
        value       uniform 0;
    }

    outlet
    {
		type 		zeroGradient;
    }
    atmosphere
    {
		type		fixedValue;
		value		uniform 0;

    }
}

// ************************************************************************* //
